# Brew
brew "gh" # GitHub CLI
brew "git-lfs" # Git extension for versioning large files
brew "git"
brew "htop"
brew "imagemagick"
brew "mas"
brew "mysql"
brew "node"
brew "openjdk"
brew "pre-commit" # managing and maintaining pre-commit hooks
brew "shellcheck" # static analysis tool for shell scripts
brew "tmux" # terminal multiplexer
brew "tree"
brew "uv" # modern python project manager
brew "wget" # allow non-GUI file download from the web

# Cask
cask "claude-code"
cask "claude"
cask "docker-desktop"
cask "figma"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "postman"
cask "visual-studio-code"
cask "zoom"

# Mac App Store
mas "GoodNotes", id: 1444383602
mas "Keynote", id: 361285480
mas "LINE", id: 539883307
mas "Numbers", id: 361304891
mas "Pages", id: 361309726